# -*- coding = utf-8 -*-
# @Time : 2021/4/25 20:27
# @Author : spray_dream
# @File : is 与 ==.py
# @Software: PyCharm

a = -1000000000000000000000000000000000000000000000000
b = -1000000000000000000000000000000000000000000000000
print(id(a))
print(id(b))

print(a is b)
'''is运算符用于比较两个对象的地址是否相同,一般是不同的,但是优化处理(
解释器会对小范围的整数[-5,256]进行缓存,地址相同,保存为文件时也是)以后值相同的话地址也相同'''
print(a == b)
# 比较两个对象的内容是否相等,值是否相等
# is运算效率比==高


# 字符串驻留机制  符合标识符规则的字符串会启用字符串驻留机制
c = 'abd_1'
d = 'abd_1'
print(c is d)
e = 'abd#'
f = 'abd#'
print(e is f)
print(e == f)
