# -*- coding = utf-8 -*-
# @Time : 2022/4/5 21:26
# @Author : spray_dream
# @File : 006-测试用例要素.py
# @Software: PyCharm
pass
"""
测试用例编号:由字符和数字组合成的字符串,用例编号具有唯一性,容易找到,相当于主键,身份证
测试项目(测试模块):比如具体某个功能,类似登录功能,注册功能
预置条件:即执行当前用例需要的前提条件,比如环境,网络,操作系统正常使用
测试输入:输入的数据,提交的表单,数据库
预期输出:预期结果,比如返回值,页面响应的结果
操作步骤:执行当前用例需要经过的操作步骤,需要有明确的描述,测试人员可以用该步骤完成测试用例执行
测试用例标题:对测试用例的简单描述,不能重复
级别:低中高
    高级别:保证系统基本功能,核心业务,重要特性,实际使用频率较高的用例
    低级别:实际使用频率不高,对系统业务功能影响不大的模块或功能的测试用例
其他要素:
    用例的设计者,用例设计日期,对应的开发人员,测试结果(实际结果),测试类型(功能,性能,压力)
"""
